### Pandas and SQLite 

This short demo shows how to connect a pandas (running in Jupyter notebook) to a sqlite database

In the terminal, run sqlite 

`$sqllite`

Then run these commands in a sqlite prompt

`sqlite> 
.open mydb
CREATE TABLE users (id INTEGER PRIMARY KEY AUTOINCREMENT,  name VARCHAR,  state VARCHAR );
INSERT INTO users (name, state) VALUES ("PinkPizza", "CO");
INSERT INTO users (name, state) VALUES ("BoulderInternetPerson", "CO");
INSERT INTO users (name, state) VALUES ("Frank41", "MA");
INSERT INTO users (name, state) VALUES ("Ponderozzza", "AZ");`

### Connecting pandas

You can use the `read_sql_query` to read from a table in pandas

In [1]:
import sqlite3
import pandas as pd
# Create your connection.
cnx = sqlite3.connect('mydb')

SQL = '''SELECT * from users'''

df = pd.read_sql_query(SQL, cnx)

df

   id                   name state
0   1              PinkPizza    CO
1   2  BoulderInternetPerson    CO
2   3                Frank41    MA
3   4            Ponderozzza    AZ

### Pandas can even make new tables.

You can use the `read_sql_query` to read from a table in pandas

In [2]:
df["state"] == "CO"

0     True
1     True
2    False
3    False
Name: state, dtype: bool

In [3]:
colorado_users = df[df["state"] == "CO"]

In [4]:
# Write the new DataFrame to a new SQLite table
colorado_users.to_sql("CO_users", cnx, if_exists="replace")

cnx.close()

### Check in terminal

In a terminal, run 

`$sqlite` 

and then in a `>sqllite` prompt run the following

`
.open mydb
select * from CO_users;
0|1|PinkPizza|CO
1|2|BoulderInternetPerson|CO
`

### Hello, Count

Based on the quiz, everyone seems to mostly have the hang of SELECT, INSERT and UPDATE. Time for a new operator. [COUNT](https://www.w3schools.com/sql/sql_count_avg_sum.asp) returns the total number of items selected.

In [16]:
import sqlite3
import pandas as pd
# Create your connection.
cnx = sqlite3.connect('mydb')

SQL = '''SELECT count(name) from users''' 

df = pd.read_sql_query(SQL, cnx)

df  # there are 4 names in the table

   count(name)
0            4

Instead of SELECT you can use SELECT DISTINCT to select unique items from a database

In [17]:
SQL = '''SELECT DISTINCT state from users'''

df = pd.read_sql_query(SQL, cnx)

df

  state
0    CO
1    MA
2    AZ

You can also count the number of distinct items like this

In [21]:
SQL = '''select count (DISTINCT state) from users'''

df = pd.read_sql_query(SQL, cnx)

df  # this returns 3

   count (DISTINCT state)
0                       3

In [22]:
SQL = '''select count (state) from users'''

df = pd.read_sql_query(SQL, cnx)

df  # this returns 4

   count (state)
0              4